In [1]:
import pandas as pd

<b>
   بأكثر من طريقة DataFrame إنشاء 
</b>

In [3]:
list1 = [1,2,3,4,5]
pd.DataFrame(list1)

   0
0  1
1  2
2  3
3  4
4  5

In [32]:
list2 = [[1,2,3,4,5],[10,20,30,40]]
pd.DataFrame(list2)

    0   1   2   3    4
0   1   2   3   4  5.0
1  10  20  30  40  NaN

In [13]:
list3 =  [['Ajay',70],['Rahul',80],['Raj',90]]
pd.DataFrame(list3,columns = ['Name','Mark'])

    Name  Mark
0   Ajay    70
1  Rahul    80
2    Raj    90

In [17]:
data = {'Name': ['Raj','Rahul','Ajay'],
       'Mark':[90,80,70]}
pd.DataFrame(data,index=['student1','student2','student3'])

           Name  Mark
student1    Raj    90
student2  Rahul    80
student3   Ajay    70

In [19]:
list4=[{'a':1,'b':2,'c':3},
      {'a':40,'b':80,'c':90}]
pd.DataFrame(list4)

    a   b   c
0   1   2   3
1  40  80  90

In [20]:
data ={ 'ashraf':pd.Series([50,70,90,80]),
        'shweky':pd.Series([60,80,40,90])  }
pd.DataFrame(data)

   ashraf  shweky
0      50      60
1      70      80
2      90      40
3      80      90

In [21]:
dic = {'Name':['Ashraf','Ahmad','Ayham','Adam','Ghassan','Aman','Islam'],
       'Marks' : [90,70,95,80,65,60,98],
       'Gender':['Male','Male','Male','Male','Male','Female','Male']}

In [22]:
df = pd.DataFrame(dic)

In [23]:
# إظهار البيانات 
df

      Name  Marks  Gender
0   Ashraf     90    Male
1    Ahmad     70    Male
2    Ayham     95    Male
3     Adam     80    Male
4  Ghassan     65    Male
5     Aman     60  Female
6    Islam     98    Male

In [24]:
df.head(3)  # إظهار اول ثلاثة سطور

     Name  Marks Gender
0  Ashraf     90   Male
1   Ahmad     70   Male
2   Ayham     95   Male

In [25]:
df.tail(3) # إظهار أخر ثلاثة سطور

      Name  Marks  Gender
4  Ghassan     65    Male
5     Aman     60  Female
6    Islam     98    Male

In [26]:
df.info() # معلومات عن البيانات

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [27]:
df.shape # شكل البيانات

(7, 3)

In [28]:
print('Number of rows = ',df.shape[0])
print('Number of columns = ',df.shape[1])

Number of rows =  7
Number of columns =  3

In [29]:
df.size # عدد الخلايا

21

In [30]:
df.isnull().sum() # القيم المفقودة في كل سطر

Name      0
Marks     0
Gender    0
dtype: int64

In [31]:
df.notnull().sum(axis=1) # القيم غير المفقودة في كل سطر

0    3
1    3
2    3
3    3
4    3
5    3
6    3
dtype: int64

In [35]:
df.describe() # معلومات إحصائية عن البيانات

           Marks
count   7.000000
mean   79.714286
std    15.129599
min    60.000000
25%    67.500000
50%    80.000000
75%    92.500000
max    98.000000

In [36]:
df['Gender'] #  إظهار أحد الأعمدة

0      Male
1      Male
2      Male
3      Male
4      Male
5    Female
6      Male
Name: Gender, dtype: object

In [37]:
df['Gender'].unique() # العناصر الوحيدة في العامود

array(['Male', 'Female'], dtype=object)

In [38]:
df['Gender'].nunique() # عدد العناصر الوجيدة في العامود

2

In [39]:
df['Gender'].value_counts() # تكرار العناصر في العامود

Male      6
Female    1
Name: Gender, dtype: int64

In [41]:
df[df['Marks'].between(80,100)] # إظهار البيانات المتمتعه بصفة معنية

     Name  Marks Gender
0  Ashraf     90   Male
2   Ayham     95   Male
3    Adam     80   Male
6   Islam     98   Male

In [40]:
df['Marks'] # إظهار عامود

0    90
1    70
2    95
3    80
4    65
5    60
6    98
Name: Marks, dtype: int64

In [42]:
sum(df['Marks'].between(80,100)) #  عدد العناصر المحققة للصفة

4

In [43]:
# معلومات إحصائية 
print('Mean of marks = ', df['Marks'].mean())
print('Min value in Marks = ', df['Marks'].min())
print('Max value in Marks = ', df['Marks'].max())

Mean of marks =  79.71428571428571
Min value in Marks =  60
Max value in Marks =  98

In [44]:
import math as mh # مكتبة

In [45]:
mh.ceil(df['Marks'].mean()) # تقريب الى الأعلى

80

In [50]:
def mark(x):
    return x//2 #  تقريب الى الأدنى

In [52]:
df['Marks'].apply(mark) # apply تقوم بطبيق دالة معينة

0    45
1    35
2    47
3    40
4    32
5    30
6    49
Name: Marks, dtype: int64

In [53]:
df['Half_value'] = df['Marks'].apply(mark) # إنشاء عامود جديد

In [54]:
df

      Name  Marks  Gender  Half_value
0   Ashraf     90    Male          45
1    Ahmad     70    Male          35
2    Ayham     95    Male          47
3     Adam     80    Male          40
4  Ghassan     65    Male          32
5     Aman     60  Female          30
6    Islam     98    Male          49

In [55]:
df['Marks'].apply(lambda x: str(x)+"%") # lambda تقوم بتطبيق دالة في ذات السطر

0    90%
1    70%
2    95%
3    80%
4    65%
5    60%
6    98%
Name: Marks, dtype: object

In [56]:
df['Percent_value'] = df['Marks'].apply(lambda x: str(x)+"%") # إضافة عامود

In [57]:
df

      Name  Marks  Gender  Half_value Percent_value
0   Ashraf     90    Male          45           90%
1    Ahmad     70    Male          35           70%
2    Ayham     95    Male          47           95%
3     Adam     80    Male          40           80%
4  Ghassan     65    Male          32           65%
5     Aman     60  Female          30           60%
6    Islam     98    Male          49           98%

In [58]:
df['Gender'].map({'Male':"♂",'Female':"♀"}) # رمز الجنس

0    ♂
1    ♂
2    ♂
3    ♂
4    ♂
5    ♀
6    ♂
Name: Gender, dtype: object

In [59]:
df['Symbol_sex'] = df['Gender'].map({'Male':"♂",'Female':"♀"}) # إضافة عامود

In [61]:
df

      Name  Marks  Gender  Half_value Percent_value Symbol_sex
0   Ashraf     90    Male          45           90%          ♂
1    Ahmad     70    Male          35           70%          ♂
2    Ayham     95    Male          47           95%          ♂
3     Adam     80    Male          40           80%          ♂
4  Ghassan     65    Male          32           65%          ♂
5     Aman     60  Female          30           60%          ♀
6    Islam     98    Male          49           98%          ♂

In [62]:
df.drop(['Half_value' ,'Percent_value'],axis = 1,inplace= True) # إسقاط أعمدة

In [63]:
df

      Name  Marks  Gender Symbol_sex
0   Ashraf     90    Male          ♂
1    Ahmad     70    Male          ♂
2    Ayham     95    Male          ♂
3     Adam     80    Male          ♂
4  Ghassan     65    Male          ♂
5     Aman     60  Female          ♀
6    Islam     98    Male          ♂

In [64]:
df.columns

Index(['Name', 'Marks', 'Gender', 'Symbol_sex'], dtype='object')

In [65]:
df.sort_values(by = ['Marks','Name'],ascending=False) # ترتيب عناصر البيانات وفق أعمدة معينة

      Name  Marks  Gender Symbol_sex
6    Islam     98    Male          ♂
2    Ayham     95    Male          ♂
0   Ashraf     90    Male          ♂
3     Adam     80    Male          ♂
1    Ahmad     70    Male          ♂
4  Ghassan     65    Male          ♂
5     Aman     60  Female          ♀

In [66]:
df[df['Name'].isin(['Ashraf'])] # إيجاد سطر محقق ل

     Name  Marks Gender Symbol_sex
0  Ashraf     90   Male          ♂

In [67]:
df[df['Marks'] >=90 ]

     Name  Marks Gender Symbol_sex
0  Ashraf     90   Male          ♂
2   Ayham     95   Male          ♂
6   Islam     98   Male          ♂

In [68]:
df.iloc[0,1] > 90

False

In [69]:
len(df.loc[6,"Name"]) > 4

True